In [1]:
import pandas as pd

In [2]:
# 2 main data types
series = pd.Series(["BMW", "Toyota", "Honda"])

In [3]:
series

0       BMW
1    Toyota
2     Honda
dtype: object

In [4]:
# series = 1-D

In [5]:
colours = pd.Series(["Red", "Blue", "White"])
colours

0      Red
1     Blue
2    White
dtype: object

In [6]:
# DataFrame = 2-D
car_data = pd.DataFrame({"Car make": series, "Colour": colours})
car_data

  Car make Colour
0      BMW    Red
1   Toyota   Blue
2    Honda  White

In [7]:
# Import data
car_sales = pd.read_csv("car-sales.csv")

In [8]:
car_sales

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [9]:
#Exporting data frames
car_sales.to_csv("exported-car-sales.csv", index=False) #.to to call the csv

In [10]:
exported_car_sales = pd.read_csv("exported-car-sales.csv")
exported_car_sales

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

## Describe Data

In [11]:
#Attribute
car_sales.dtypes

#Function
#car_sales.csv.to_csv

Make             object
Colour           object
Odometer (KM)     int64
Doors             int64
Price            object
dtype: object

In [12]:
car_columns = car_sales.columns
car_columns

Index(['Make', 'Colour', 'Odometer (KM)', 'Doors', 'Price'], dtype='object')

In [13]:
car_sales.index

RangeIndex(start=0, stop=10, step=1)

In [14]:
car_sales.describe() #statistic info

       Odometer (KM)      Doors
count      10.000000  10.000000
mean    78601.400000   4.000000
std     61983.471735   0.471405
min     11179.000000   3.000000
25%     35836.250000   4.000000
50%     57369.000000   4.000000
75%     96384.500000   4.000000
max    213095.000000   5.000000

In [15]:
car_sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Make           10 non-null     object
 1   Colour         10 non-null     object
 2   Odometer (KM)  10 non-null     int64
 3   Doors          10 non-null     int64
 4   Price          10 non-null     object
dtypes: int64(2), object(3)
memory usage: 532.0+ bytes

In [16]:
car_sales.mean()

C:\Users\HP4021\AppData\Local\Temp\ipykernel_33260\4073448239.py:1: FutureWarning: The default value of numeric_only in DataFrame.mean is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  car_sales.mean()

Odometer (KM)    78601.4
Doors                4.0
dtype: float64

In [17]:
car_prices = pd.Series([3000, 1500, 111250])
car_prices.mean()

38583.333333333336

In [18]:
car_sales["Doors"].sum()

40

In [19]:
len(car_sales)

10

In [20]:
car_sales

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

## Viewing and Selecting Data

In [21]:
car_sales.head() #return top 5 data rows for the frame

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00

In [22]:
car_sales.head(7)

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00

In [23]:
car_sales.tail()

     Make Colour  Odometer (KM)  Doors      Price
5  Toyota  Green          99213      4  $4,500.00
6   Honda   Blue          45698      4  $7,500.00
7   Honda   Blue          54738      4  $7,000.00
8  Toyota  White          60000      4  $6,250.00
9  Nissan  White          31600      4  $9,700.00

In [24]:
# .loc & .iloc
animals = pd.Series(["cat", "dog", "bird", "panda", "snake"], index=[0, 3, 9, 8, 3])

In [25]:
animals

0      cat
3      dog
9     bird
8    panda
3    snake
dtype: object

In [26]:
animals.loc[3] #loc - location - index

3      dog
3    snake
dtype: object

In [27]:
animals.loc[9]

'bird'

In [28]:
car_sales.loc[3]

Make                    BMW
Colour                Black
Odometer (KM)         11179
Doors                     5
Price            $22,000.00
Name: 3, dtype: object

In [29]:
animals

0      cat
3      dog
9     bird
8    panda
3    snake
dtype: object

In [30]:
# .iloc refers to position
animals.iloc[3]

'panda'

In [31]:
car_sales.iloc[3]

Make                    BMW
Colour                Black
Odometer (KM)         11179
Doors                     5
Price            $22,000.00
Name: 3, dtype: object

In [32]:
animals.iloc[:3]

0     cat
3     dog
9    bird
dtype: object

In [33]:
car_sales.loc[:3]

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00

In [34]:
car_sales.head(4)

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00

In [35]:
car_sales["Make"]

0    Toyota
1     Honda
2    Toyota
3       BMW
4    Nissan
5    Toyota
6     Honda
7     Honda
8    Toyota
9    Nissan
Name: Make, dtype: object

In [36]:
car_sales["Colour"]

0    White
1      Red
2     Blue
3    Black
4    White
5    Green
6     Blue
7     Blue
8    White
9    White
Name: Colour, dtype: object

In [37]:
car_sales.Make

0    Toyota
1     Honda
2    Toyota
3       BMW
4    Nissan
5    Toyota
6     Honda
7     Honda
8    Toyota
9    Nissan
Name: Make, dtype: object

In [38]:
car_sales.Odometer (KM)

AttributeError: 'DataFrame' object has no attribute 'Odometer'

In [39]:
car_sales["Odometer (KM)"]

0    150043
1     87899
2     32549
3     11179
4    213095
5     99213
6     45698
7     54738
8     60000
9     31600
Name: Odometer (KM), dtype: int64

In [40]:
car_sales[car_sales["Make"] == "Toyota"]

     Make Colour  Odometer (KM)  Doors      Price
0  Toyota  White         150043      4  $4,000.00
2  Toyota   Blue          32549      3  $7,000.00
5  Toyota  Green          99213      4  $4,500.00
8  Toyota  White          60000      4  $6,250.00

In [41]:
car_sales[car_sales["Odometer (KM)"] > 100000]

In [42]:
pd.crosstab(car_sales["Make"], car_sales["Doors"])

In [43]:
#Groubby
car_sales.groupby(["Make"]).mean()

In [44]:
%matplotlib inline
import matplotlib.pyplot as plot

In [45]:
car_sales["Odometer (KM)"].plot()

In [46]:
car_sales["Odometer (KM)"].hist()

In [47]:
car_sales["Price"].dtype

In [48]:
car_sales["Price"] = car_sales["Price"].str.replace('[\$\,\.]','',).astype(int)

In [49]:
car_sales["Price"]

In [50]:
car_sales["Price"].plot()

## Manipulating Data

In [51]:
car_sales["Make"].str.lower()

In [52]:
car_sales["Make"] = car_sales["Make"].str.lower()
car_sales

In [53]:
car_sales_missing = pd.read_csv("car-sales-missing-data.csv")
car_sales_missing

In [54]:
car_sales_missing["Odometer"].mean()

In [55]:
car_sales_missing["Odometer"].fillna(car_sales_missing["Odometer"].mean())

In [56]:
car_sales_missing

In [57]:
car_sales_missing["Odometer"].fillna(car_sales_missing["Odometer"].mean(), inplace=True)
car_sales_missing

In [58]:
car_sales_missing.dropna(inplace=True) 
car_sales_missing

In [59]:
car_sales_missing = pd.read_csv("car-sales-missing-data.csv")
car_sales_missing

In [60]:
car_sales_missing_dropped = car_sales_missing.dropna()
car_sales_missing_dropped

In [61]:
car_sales_missing_dropped.to_csv("car-sales-missing-dropped.csv")

In [62]:
# column from series
seats_column = pd.Series([5,5,5,5,5])

#New column called seats
car_sales["Seats"] = seats_column
car_sales

In [63]:
car_sales["Seats"].fillna(5, inplace=True)
car_sales

In [64]:
# column from Python List
fuel_economy = [7.5, 9.2, 5.0, 9.6, 8.7, 3.6, 9.0, 2.3, 5.4, 6.5]
car_sales["Fuel per 100KM"] = fuel_economy
car_sales

In [65]:
car_sales["Total fuel used"] = car_sales["Odometer (KM)"]/100 * car_sales["Fuel per 100KM"]
car_sales

In [66]:
# Create a column from a single value
car_sales["Number of wheels"] = 4
car_sales

In [67]:
car_sales["Passed road safety"] = True
car_sales.dtypes

In [68]:
car_sales

In [69]:
car_sales = car_sales.drop("Total fuel used", axis=1)
car_sales

In [70]:
car_sales_shuffled = car_sales.sample(frac=1) #to shuffle the df
car_sales_shuffled

In [71]:
#Only select 20% of the data
car_sales_shuffled.sample(frac=0.2)

In [72]:
car_sales_shuffled.reset_index(drop=True, inplace=True)
car_sales_shuffled

In [73]:
car_sales["Odometer (KM)"] = car_sales["Odometer (KM)"].apply(lambda x: x/1.6)
car_sales